app/Controllers/AdminController.php

SELECT *
FROM `admin`
WHERE `admin`.`admin_id` = '1'
---
    public function adminRegistration() {

        $adminModel = new  \App\Models\AdminModel();
        $activeAdminId= session()->get('activeAdmin');
        $adminData = $adminModel->find($activeAdminId);

SELECT *
FROM `admin`
WHERE `admin`.`admin_id` = '1'
SELECT *
FROM `admin`
WHERE `status` = 1
ORDER BY `created_at` DESC
---
    public function adminViewAll() {
        $adminModel = new AdminModel();

        $activeAdminId= session()->get('activeAdmin');
        $adminData    = $adminModel->find($activeAdminId);
        $adminFetch   = $adminModel->where('status', 1)->orderBy('created_at', 'DESC')->findAll();

SELECT *
FROM `admin`
WHERE `admin`.`admin_id` = '1'
SELECT *
FROM `admin`
WHERE `status` = 0
ORDER BY `created_at` DESC
---
    public function adminViewDisabled() {
        $adminModel = new AdminModel();

        $activeAdminId= session()->get('activeAdmin');
        $adminData    = $adminModel->find($activeAdminId);
        $adminFetch   = $adminModel->where('status', 0)->orderBy('created_at', 'DESC')->findAll();