app/Controllers/CerealController.php

SELECT *
FROM `admin`
WHERE `admin`.`admin_id` = '1'
---
    public function cerealRegister() {

        $adminModel = new AdminModel();
        $activeAdminId= session()->get('activeAdmin');
        $adminData = $adminModel->find($activeAdminId);

SELECT *
FROM `cereal`
ORDER BY `created_at` DESC
---
    public function cerealApplication() {
        $userModel  = new UserModel();
        $cerealModel= new CerealModel();

        $activeUserId= session()->get('activeUser');
        $userData    = $userModel->find($activeUserId);
        $viewCereals   = $cerealModel->orderBy('created_at', 'DESC')->findAll();

SELECT *
FROM `admin`
WHERE `admin`.`admin_id` = '2'
---
    public function cerealAppRequests() {

        $appModel   = new ApplicationModel();
        $adminModel = new AdminModel();

        $activeAdminId = session()->get('activeAdmin');

SELECT *
FROM `admin`
WHERE `admin`.`admin_id` = '2'
SELECT *
FROM `application`
WHERE `application`.`app_id` = '8'
SELECT *
FROM `cereal`
WHERE `cereal`.`cereal_id` = '9'
SELECT *
FROM `fertilizer`
ORDER BY `item_type` ASC
---
    public function cerealApproval() {
        $f_f_model  = new FFarmerModel();
        $fert_Model = new FertilizerModel();
        $adminModel = new AdminModel();
        $appModel   = new ApplicationModel();
        $cerealModel= new CerealModel();
        $userModel  = new UserModel();

        // From hidden input type
        $app_id     = $this->request->getVar('app_id');
        $cereal_id  = $this->request->getVar('cereal_id');
        $cereal_type= $this->request->getVar('cereal_type');
        $cereal_price= $this->request->getVar('cereal_price');
        $farmer_id  = $this->request->getVar('farmer_id');
        $quantity   = $this->request->getVar('quantity');
        $firstname  = $this->request->getVar('firstname');
        $lastname   = $this->request->getVar('lastname');
        $telephone  = $this->request->getVar('telephone');
        $fert1      = $this->request->getVar('fert1');
        $fert2      = $this->request->getVar('fert2');
        $fert3      = $this->request->getVar('fert3');
        $f_quantity = $this->request->getVar('f_quantity');
        $totalPrice = $cereal_price * $quantity;

        $activeAdminId= session()->get('activeAdmin');
        $adminData    = $adminModel->find($activeAdminId);

        // Getting & carry data to view separately
        $appDataX      = $appModel->find($app_id);
        $cerealDataX   = $cerealModel->find($appDataX['cereal_id']);
        $farmerDataX   = $userModel->find($appDataX['farmer_id']);

        // Fetch fertilizer to check for before submission @gadrawingz
        $fertilizers  = $this->db->table('fertilizer')->orderBy('item_type', 'ASC')->get()->getResult();