app/Controllers/DashController.php

SELECT *
FROM `farmer`
WHERE `farmer`.`farmer_id` = '2'
---
    public function farmerLogout() {
        if(session()->has('activeUser')) {
            session()->remove('activeUser');
            return redirect()->to('farmer/login?access=out')->with('fail', 'You are logged out!');