app/Controllers/DashController.php

SELECT *
FROM `application`
WHERE `farmer_id` = '2'
AND `status` = 0
SELECT *
FROM `application`
WHERE `farmer_id` = '24'
AND `status` = 0
SELECT *
FROM `harvest`
WHERE `farmer_id` = '2'
AND `status` = 0
SELECT *
FROM `harvest`
WHERE `farmer_id` = '24'
AND `status` = 0
---
    public function farmerDashboard() {

        $userModel = new UserModel();
        $appModel   = new ApplicationModel();
        $cerealModel= new CerealModel();
        $harvestModel= new HarvestModel();

        $activeUI= session()->get('activeUser');
        $userData = $userModel->find($activeUI);

        $c_req_yes = $appModel->where(['farmer_id'=> $activeUI, 'status'=> 1])->get()->getNumRows();
        $c_req_no  = $appModel->where(['farmer_id'=> $activeUI, 'status'=> 0])->get()->getNumRows();
        $h_req_yes = $harvestModel->where(['farmer_id'=> $activeUI, 'status'=> 1])->get()->getNumRows();
        $h_req_no  = $harvestModel->where(['farmer_id'=> $activeUI, 'status'=> 0])->get()->getNumRows();

SELECT *
FROM `admin`
WHERE `admin`.`admin_id` = '2'
---
    public function adminDashboard() {

        $userModel  = new UserModel();
        $adminModel = new AdminModel();
        $appModel   = new ApplicationModel();
        $cerealModel= new CerealModel();
        $harvestModel= new HarvestModel();

        $activeAdminId= session()->get('activeAdmin');
        $adminData = $adminModel->find($activeAdminId);

        $all_count = $adminModel->get()->getNumRows();

SELECT *
FROM `admin`
WHERE `admin`.`admin_id` = '1'
---
    public function adminProfile() {

        $adminModel = new  \App\Models\AdminModel();
        $distModel  = new  \App\Models\DistrictModel();

        $activeAdminId= session()->get('activeAdmin');