app/Controllers/Fertilizer.php

SELECT *
FROM `admin`
WHERE `admin`.`admin_id` = '2'
---
    public function fertilizerRegister() {

        $adminModel = new AdminModel();
        $cerealModel = new CerealModel();
        $fertilizer = new FertilizerModel();

        $activeAdminId= session()->get('activeAdmin');
        $adminData = $adminModel->find($activeAdminId);