app/Controllers/HarvestController.php

SELECT *
FROM `cereal`
ORDER BY `created_at` DESC
---
    public function harvestRegister() {
        $userModel  = new UserModel();
        $cerealModel= new CerealModel();

        $activeUserId= session()->get('activeUser');
        $userData    = $userModel->find($activeUserId);
        $viewCereals = $cerealModel->orderBy('created_at', 'DESC')->findAll();

SELECT *
FROM `admin`
WHERE `admin`.`admin_id` = '2'
---
    public function harvestsUnchecked() {

        $adminModel    = new AdminModel();
        $harvestModel  = new HarvestModel();
        $cerealModel   = new CerealModel();

        $activeAdminId = session()->get('activeAdmin');

SELECT *
FROM `admin`
WHERE `admin`.`admin_id` = '2'
SELECT `c`.`cereal_name`, `c`.`cereal_type`, `c`.`land_type`, `h`.`harvest_id`, `h`.`quantity` AS `hquantity`, `h`.`season` AS `hseason`, `h`.`current_price`, `h`.`outcome` AS `result`, `h`.`status` AS `harvestatus`, `h`.`harvest_date`
FROM `harvest` `h`
LEFT JOIN `cereal` `c` ON `c`.`cereal_id`=`h`.`cereal_id`
WHERE `h`.`status` = 1
ORDER BY `h`.`harvest_date` DESC
---
    public function harvestsChecked() {
        $adminModel    = new AdminModel();
        $harvestModel  = new HarvestModel();
        $cerealModel   = new CerealModel();

        $activeAdminId = session()->get('activeAdmin');
        $adminData     = $adminModel->find($activeAdminId);

        $viewHarvests  = $this->db->table($this->table)->select('c.cereal_name, c.cereal_type, c.land_type, h.harvest_id, h.quantity AS hquantity, h.season AS hseason, h.current_price, h.outcome AS result, h.status AS harvestatus, h.harvest_date')->join('cereal c', 'c.cereal_id=h.cereal_id', 'left')->where(["h.status" => 1])->orderBy('h.harvest_date', 'DESC')->get()->getResult();

SELECT *
FROM `harvest`
WHERE `harvest_id` = '1'
 LIMIT 1
---
    public function approve($id = null) {

        $harvestModel = new HarvestModel();
        $userModel    = new UserModel();

        $data = ['status'   => '1'];
        $harvestModel->update($id, $data);

        // SMS API Integration @gadrawingz
        $harvest    = $harvestModel->where('harvest_id', $id)->first();