app/Controllers/RegionController.php

    public function regionViewAll() {
        $regionModel = new RegionModel();
        $cerealModel = new CerealModel();
        $adminModel  = new AdminModel();

        $activeAdmin = session()->get('activeAdmin');
        $adminData   = $adminModel->find($activeAdmin);
---
SELECT *
FROM `admin`
WHERE `admin`.`admin_id` = '2'