app/Controllers/ReportController.php

SELECT *
FROM `admin`
WHERE `admin`.`admin_id` = '1'
SELECT *
FROM `fertilizer`
SELECT *
FROM `admin`
WHERE `admin_role` = 'Admin'
SELECT *
FROM `harvest`
SELECT *
FROM `cereal`
---
    public function viewGeneralReport() {

        $userModel   = new UserModel();
        $adminModel  = new AdminModel();
        $appModel    = new ApplicationModel();
        $cerealModel = new CerealModel();
        $harvestModel= new HarvestModel();
        $fert_Model  = new FertilizerModel();

        $activeAdminId= session()->get('activeAdmin');
        $adminData = $adminModel->find($activeAdminId);

        $all_count = $adminModel->get()->getNumRows();
        $ferts_count= $fert_Model->get()->getNumRows();
        $adm_count = $adminModel->where('admin_role', 'Admin')->get()->getNumRows();
        $agr_count = $adminModel->where('admin_role', 'Agrodealer')->get()->getNumRows();
        $hrv_count = $harvestModel->get()->getNumRows();

        // farmer's Donee(s)
        $active_fc  = $userModel->where('status', 1)->get()->getNumRows();
        $inactive_fc= $userModel->where('status', 0)->get()->getNumRows();

        // Cereals
        $cer_count = $cerealModel->get()->getNumRows();

SELECT *
FROM `admin`
WHERE `admin`.`admin_id` = '2'
SELECT *
FROM `cereal`
SELECT *
FROM `application`
SELECT *
FROM `harvest`
SELECT *
FROM `fertilizer`
---
    public function viewAgroReport() {

        $userModel   = new UserModel();
        $adminModel  = new AdminModel();
        $appModel    = new ApplicationModel();
        $cerealModel = new CerealModel();
        $harvestModel= new HarvestModel();
        $fert_Model  = new FertilizerModel();

        $activeAdminId= session()->get('activeAdmin');
        $adminData = $adminModel->find($activeAdminId);

        // farmer's Donee(s)
        $active_fc   = $userModel->where('status', 1)->get()->getNumRows();
        $inactive_fc = $userModel->where('status', 0)->get()->getNumRows();
        $all_fc_count= $userModel->get()->getNumRows();

        // Cereals count;
        $all_c_count = $cerealModel->get()->getNumRows();
        $c_req_count = $appModel->get()->getNumRows();

        // Harvest and fertilizers counts
        $all_h_count = $harvestModel->get()->getNumRows();
        $all_ft_title= $fert_Model->get()->getNumRows();

SELECT *
FROM `admin`
WHERE `admin`.`admin_id` = '1'
SELECT *
FROM `cereal`
SELECT *
FROM `application`
SELECT *
FROM `harvest`
SELECT *
FROM `fertilizer`
SELECT `c`.`cereal_name`, `c`.`cereal_type`, `c`.`land_type`, `h`.`harvest_id`, `h`.`quantity` AS `hquantity`, `h`.`season` AS `hseason`, `h`.`current_price`, `h`.`outcome` AS `result`, `h`.`status` AS `harvestatus`, `h`.`harvest_date`
FROM `harvest` `h`
LEFT JOIN `cereal` `c` ON `c`.`cereal_id`=`h`.`cereal_id`
ORDER BY `h`.`harvest_date` DESC
SELECT `c`.`cereal_name`, `c`.`cereal_type`, `c`.`land_type`, `app`.`app_id`, `app`.`farmer_id`, `app`.`cereal_id`, `app`.`quantity`, `app`.`season`, `app`.`status` AS `appstatus`, `app`.`app_date`, `f`.`firstname`, `f`.`lastname`, `f`.`telephone`
FROM `application` `app`
LEFT JOIN `cereal` `c` ON `c`.`cereal_id`=`app`.`cereal_id`
LEFT JOIN `farmer` `f` ON `f`.`farmer_id`=`app`.`farmer_id`
ORDER BY `app`.`app_date` DESC
---
    public function viewAgroFullReport() {

        $userModel   = new UserModel();
        $adminModel  = new AdminModel();
        $appModel    = new ApplicationModel();
        $cerealModel = new CerealModel();
        $harvestModel= new HarvestModel();
        $fert_Model  = new FertilizerModel();

        $activeAdminId= session()->get('activeAdmin');
        $adminData = $adminModel->find($activeAdminId);

        // farmer's Donee(s)
        $active_fc   = $userModel->where('status', 1)->get()->getNumRows();
        $inactive_fc = $userModel->where('status', 0)->get()->getNumRows();
        $all_fc_count= $userModel->get()->getNumRows();

        // Cereals count;
        $all_c_count = $cerealModel->get()->getNumRows();
        $c_req_count = $appModel->get()->getNumRows();

        // Harvest and fertilizers counts
        $all_h_count = $harvestModel->get()->getNumRows();
        $all_ft_title= $fert_Model->get()->getNumRows();

        // Harvests Retrieval!
        $viewHarvests  = $this->db->table('harvest h')->select('c.cereal_name, c.cereal_type, c.land_type, h.harvest_id, h.quantity AS hquantity, h.season AS hseason, h.current_price, h.outcome AS result, h.status AS harvestatus, h.harvest_date')->join('cereal c', 'c.cereal_id=h.cereal_id', 'left')->orderBy('h.harvest_date', 'DESC')->get()->getResult();

        $viewCereals  = $this->db->table('application app')->select('c.cereal_name, c.cereal_type, c.land_type, app.app_id, app.farmer_id, app.cereal_id, app.quantity, app.season, app.status AS appstatus, app.app_date, f.firstname, f.lastname, f.telephone')->join('cereal c', 'c.cereal_id=app.cereal_id', 'left')->join('farmer f', 'f.farmer_id=app.farmer_id', 'left')->orderBy('app.app_date', 'DESC')->get()->getResult();

SELECT *
FROM `admin`
WHERE `admin`.`admin_id` = '4'
---
    public function viewFullStats() {

        $userModel   = new UserModel();
        $adminModel  = new AdminModel();
        $appModel    = new ApplicationModel();
        $cerealModel = new CerealModel();
        $harvestModel= new HarvestModel();
        $fert_Model  = new FertilizerModel();

        $activeAdminId= session()->get('activeAdmin');