app/Controllers/UserController.php

    public function index() {
        $adminModel = new AdminModel();
        $userModel  = new userModel();

        $activeAdminId= session()->get('activeAdmin');
        $adminData    = $adminModel->find($activeAdminId);
---
SELECT *
FROM `admin`
WHERE `admin`.`admin_id` = '2'